# Pascal--

# Цели и задачи

В рамках лабораторной работы ставится задача о разработке среды исполнения программ на языке Pascal--. Необходимо соблюсти следующие требования:

 - Регистр написания команд и переменных не важен;
 - В программе должен осуществляться синтаксический контроль;
 - Условные операторы могут быть вложены;
 - Текст программы хранится в иерархическом списке;
 - Таблица переменных и констант должна храниться в виде хэш-таблицы;
 - Арифметические выражения вычисляются с помощью постфикса;
 - Программа начинает исполнение после команды begin;
 - Программа завершается командой end, за которой следует символ точки: end.

Минимальный функционал, который должна поддерживать среда разработки:

 - Секции const, var, begin, end;
 - Условные операторы if, then / else;
 - Функция вывода с консоли read() и ввода с консоли write();
 - Поддержа математических операция: '+', '-', '*', div (деление нацело), mod (деление по модулю);
 - Оператор присваивания :=;

## Использумеые инструменты

  - Система контроля версий Git.
  - Фреймворк для написания автоматических тестов [googletest](https://github.com/google/googletest).
  - Среда разработки Microsoft Visual Studio.
  - Утилита [CMake](http://www.cmake.org) для генерации проектов по сборке исходных кодов.

## Общая структура проекта

Структура проекта:
  
  - `googletest` — библиотека Google Test.
  - `mypascal_lib` - директория расположения статической библиотеки проекта, в которой расположен основной код.
    - `include` — директория для размещения заголовочных файлов.
    - `src` — директория для размещения исходных кодов.
  - `sample` — директория для размещения тестового приложения.
  - `test` — директория с модульными тестами и основным приложением, инициализирующим запуск тестов.
  - `README.md` — информация о проекте, которую вы сейчас читаете.
  - Служебные файлы
    - `.gitignore` — перечень расширений файлов, игнорируемых Git при добавлении
      файлов в репозиторий.
    - `CMakeLists.txt` — корневой файл для сборки проекта с помощью CMake. Может
      быть использован для генерации проекта в среде разработки, отличной от
      Microsoft Visual Studio.

## Основные объекты

В работе используются следующие объекты: 

- постфикс;
- хеш-таблица;
- иерархический список;
- разборщик текста;
- объект, выполняющий синтаксический анализ (?);
- компилятор.

## Основные алгоритмы

- разбор текста и формирование иерархического списка;
- синтаксический анализ;
- формирование исполняемого кода;
- перевод арифметических выражений в постфиксную форму;
- вычисление арифметического выражения, используя постфиксную форму;
- вставка, поиск и удаление элементов для хеш-таблицы;

## Описание основных объектов
### Разборщик текста
Разборщик текста предназначен для того, чтобы разобрать исходный текст программы на лексемы и поместить их в иерархический список для того, чтобы (объект с.а.) смог провести анализ.

### Объект, выполняющий синтаксический анализ (?)

Необходим для того, чтобы проверить корректность синтаксиса исходного кода.

### Компилятор
Компилятор предназначен для того, чтобы сгенерировать некоторые функции, которые имитировали бы создание исполняемого кода.

## Ссылки на ресурсы, позволяющие ознакомиться с алгоритмами

- Алгоритм перевода арифметического выражения из инфиксной в постфиксную форму: https://www.geeksforgeeks.org/stack-set-2-infix-to-postfix/;
- Хэш-таблицы: https://www.geeksforgeeks.org/hashing-data-structure/;
- ...
